ERP.belugaerp/src/InformationRegisters/бг_НастройкиОтправкиПечатныхФорм/бг_НастройкиОтправкиПечатныхФорм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_НастройкиОтправкиПечатныхФорм</name>
  <resources>
    <name>АдресДляРассылки</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </resources>
  <dimensions>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПечатнойФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/бг_НастройкиОтправкиПечатныхФорм/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Определяет электронный адрес, используемый для данной ПФ
//
//	Параметры:
//		ОбъектМетаданные - метаданные объекта, которому принадлежит печатная форма
//		ИдентификаторПечатнойФормы - Строка - Идентификатор печатной формы, как он задан в конфигураторе
//
//	Возвращаемое значение:
//		СправочникСсылка.ВидыКонтактнойИнформации - электронный адрес
//
Функция АдресДляРассылки(ОбъектМетаданные, ИдентификаторПечатнойФормы, Знач Организация = Неопределено) Экспорт  
	УстановитьПривилегированныйРежим(Истина);
	Результат = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бг_НастройкиПечатныхФорм.АдресДляРассылки КАК АдресДляРассылки
	|ИЗ
	|	РегистрСведений.бг_НастройкиОтправкиПечатныхФорм КАК бг_НастройкиПечатныхФорм
	|ГДЕ
	|	бг_НастройкиПечатныхФорм.ИмяОбъекта = &ИмяОбъекта
	|	И бг_НастройкиПечатныхФорм.ИдентификаторПечатнойФормы = &ИдентификаторПечатнойФормы
	|	И (бг_НастройкиПечатныхФорм.Организация = &Организация
	|			ИЛИ бг_НастройкиПечатныхФорм.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))";
	Запрос.УстановитьПараметр("ИмяОбъекта", ОбъектМетаданные.Имя);          
	Организация = ?(Организация = Неопределено, 
		ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"),
		Организация);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ИдентификаторПечатнойФормы", ИдентификаторПечатнойФормы);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.АдресДляРассылки;
	КонецЕсли;
	Возврат Результат;
КонецФункции
	
#КонецОбласти
